---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Document..::..Delete Method
Document Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Delete(ElementId) | Deletes an element from the document given the id of that element. |
|  | Delete(ICollection<(Of <<'(ElementId>)>>)) | Deletes a set of elements from the document. |

# See Also

Document Class

Document Members

Autodesk.Revit.DB Namespace